/**
* @version $Id: Win32.cs 3 2009-02-03 12:52:09Z AKuzmin $
* @package Gordago
* @copyright Copyright (C) 2008 CMSBrick. All rights reserved.
* @license http://www.gnu.org/copyleft/gpl.html GNU/GPL
*/
namespace Gordago.Trader.Common
{
  using System;
  using System.Collections.Generic;
  using System.Text;
  using System.Runtime.InteropServices;
  using System.Drawing;
  using System.Security;
  using System.Security.Permissions;

  public delegate bool EnumChildProc(IntPtr hwnd, IntPtr lparam);
  public delegate IntPtr HookHandler(int ncode, IntPtr wparam, IntPtr lparam);


  // [SuppressUnmanagedCodeSecurity()]
  /* Стоило-бы добавить SuppressUnmanagedCodeSecurity к импортируемым WinAPI 
   * функциям. Обеспечить корректность передаваемых параметров не так сложно. 
   * А лишний security check совершенно никчему.*/

  class Win32 {
    public const int BDR_INNER = 12;
    public const int BDR_OUTER = 3;
    public const int BDR_RAISED = 5;
    public const int BDR_RAISEDINNER = 4;
    public const int BDR_RAISEDOUTER = 1;
    public const int BDR_SUNKEN = 10;
    public const int BDR_SUNKENINNER = 8;
    public const int BDR_SUNKENOUTER = 2;
    public const int BF_ADJUST = 0x2000;
    public const int BF_BOTTOM = 8;
    public const int BF_FLAT = 0x4000;
    public const int BF_LEFT = 1;
    public const int BF_MIDDLE = 0x800;
    public const int BF_MONO = 0x8000;
    public const int BF_RIGHT = 4;

      ETO_OPAQUE = 0x2,
      ETO_PDY = 0x2000,
      ETO_RTLREADING = 0x800,
    }

    [StructLayout(LayoutKind.Sequential)]
    public struct ColorRef {
      public byte rgbRed;
      public byte rgbGreen;
      public byte rgbBlue;
      public byte rgbReserved;
      public System.Drawing.Color Color {
        get {
          return System.Drawing.Color.FromArgb(this.rgbRed, this.rgbGreen, this.rgbBlue);
        }
      }
    }

    [StructLayout(LayoutKind.Sequential)]
    public struct GdiPoint {
      public int X;
      public int Y;
      public GdiPoint(int x, int y) {
        this.X = x;
        this.Y = y;
      }
    }

    [StructLayout(LayoutKind.Sequential)]
    public struct GdiRect {
      public int left;
      public int top;
      public int right;
      public int bottom;

      public GdiRect(int l, int t, int r, int b) {
        this.left = l;
        this.top = t;
        this.right = r;
        this.bottom = b;
      }

      public GdiRect(Rectangle rect) {
        this.left = rect.Left;
        this.top = rect.Top;
        this.right = rect.Right;
        this.bottom = rect.Bottom;
      }

      public Rectangle ToRectangle() {
        return new Rectangle(this.left, this.top, this.right - this.left, this.bottom - this.top);
      }
    }

    [StructLayout(LayoutKind.Sequential)]
    public struct GdiSize {
      public int cx;
      public int cy;
      public GdiSize(int cx, int cy) {
        this.cx = cx;
        this.cy = cy;
      }

      public GdiSize(Size size) {
        this.cx = size.Width;
        this.cy = size.Height;
      }

      public Size ToSize() {
        return new Size(this.cx, this.cy);
      }
    }

    [StructLayout(LayoutKind.Explicit)]
    public struct INITCOMMONCONTROLSEX {
      [FieldOffset(8)]
      public int dwICC;
      [FieldOffset(0)]
      public int dwSize;
    }

    [StructLayout(LayoutKind.Sequential)]
    public struct LogBrush {
      public int style;
      public int color;
      public IntPtr hatch;
      public LogBrush(int style, int color, IntPtr hatch) {
        this.style = style;
        this.color = color;
        this.hatch = hatch;
      }
    }

    [StructLayout(LayoutKind.Sequential)]
    public struct MOUSEHOOKSTRUCT {
      public Win32.GdiPoint Pt;
      public IntPtr hwnd;
      public uint wHitTestCode;
      public IntPtr dwExtraInfo;
    }

    [StructLayout(LayoutKind.Sequential)]
    public struct MSG {
      public IntPtr hwnd;
      public int message;
      public IntPtr wparam;
      public IntPtr lparam;
      public uint time;
      public Win32.GdiPoint Pt;
    }

    [StructLayout(LayoutKind.Explicit)]
    public struct ScrollInfo {
      [FieldOffset(0)]
      public uint cbSize;
      [FieldOffset(4)]
      public uint fMask;
      [FieldOffset(12)]
      public int nMax;
      [FieldOffset(8)]
      public int nMin;
      [FieldOffset(0x10)]
      public uint nPage;
      [FieldOffset(20)]
      public int nPos;
      [FieldOffset(0x18)]
      public int nTrackPos;
    }

    /// <summary>
    ///     Specifies a raster-operation code. These codes define how the color data for the
    ///     source rectangle is to be combined with the color data for the destination
    ///     rectangle to achieve the final color.
    /// </summary>
    public enum TernaryRasterOperations : uint {
      /// <summary>dest = source</summary>
      SRCCOPY = 0x00CC0020,
      /// <summary>dest = source OR dest</summary>
      SRCPAINT = 0x00EE0086,
      /// <summary>dest = source AND dest</summary>
      SRCAND = 0x008800C6,
      /// <summary>dest = source XOR dest</summary>
      SRCINVERT = 0x00660046,
      /// <summary>dest = source AND (NOT dest)</summary>
      SRCERASE = 0x00440328,
      /// <summary>dest = (NOT source)</summary>
      NOTSRCCOPY = 0x00330008,
      /// <summary>dest = (NOT src) AND (NOT dest)</summary>
      NOTSRCERASE = 0x001100A6,
      /// <summary>dest = (source AND pattern)</summary>
      MERGECOPY = 0x00C000CA,
      /// <summary>dest = (NOT source) OR dest</summary>
      MERGEPAINT = 0x00BB0226,
      /// <summary>dest = pattern</summary>
      PATCOPY = 0x00F00021,
      /// <summary>dest = DPSnoo</summary>
      PATPAINT = 0x00FB0A09,
      /// <summary>dest = pattern XOR dest</summary>
      PATINVERT = 0x005A0049,
      /// <summary>dest = (NOT dest)</summary>
      DSTINVERT = 0x00550009,
      /// <summary>dest = BLACK</summary>
      BLACKNESS = 0x00000042,
      /// <summary>dest = WHITE</summary>
      WHITENESS = 0x00FF0062
    }

    [StructLayout(LayoutKind.Explicit)]
    public struct TextMetrics {
      [FieldOffset(4)]
      public int Accent;
      [FieldOffset(20)]
      public int AveCharWidth;
      [FieldOffset(0x39)]
      public byte BreakChar;
      [FieldOffset(0x34)]
      public byte CharSet;
      [FieldOffset(0x2e)]
      public byte DefaultChar;
      [FieldOffset(8)]
      public int Descent;
      [FieldOffset(0x24)]
      public int DigitizedAspectX;
      [FieldOffset(40)]
      public int DigitizedAspectY;
      [FieldOffset(0x10)]
      public int ExternalLeading;
      [FieldOffset(0x2c)]
      public byte FirstChar;
      [FieldOffset(0)]
      public int Height;
      [FieldOffset(0x3a)]
      public byte Italic;
      [FieldOffset(0x2d)]
      public byte LastChar;
      [FieldOffset(0x18)]
      public int MaxCharWidth;
      [FieldOffset(0x20)]
      public int Overhang;
      [FieldOffset(0x33)]
      public byte PitchAndFamily;
      [FieldOffset(12)]
      public int publicLeading;
      [FieldOffset(0x34)]
      private int Reserved;
      [FieldOffset(50)]
      public byte StruckOut;
      [FieldOffset(0x31)]
      public byte Underlined;
      [FieldOffset(0x1c)]
      public int Weight;
    }

    [StructLayout(LayoutKind.Explicit)]
    public struct XFORM {
      [FieldOffset(0x10)]
      public float eDx;
      [FieldOffset(20)]
      public float eDy;
      [FieldOffset(0)]
      public float eM11;
      [FieldOffset(4)]
      public float eM12;
      [FieldOffset(8)]
      public float eM21;
      [FieldOffset(12)]
      public float eM22;

      public XFORM(float m11, float m12, float m21, float m22, float dx, float dy) {
        this.eM11 = m11;
        this.eM12 = m12;
        this.eM21 = m21;
        this.eM22 = m22;
        this.eDx = dx;
        this.eDy = dy;
      }
    }
  }
}
